package com.joyintech.tams.svreport.chb.monthreport.dto;

import java.util.List;

import com.joyintech.framework.constant.GlobalConstant;
import com.joyintech.framework.util.StringUtil;

public enum ChbMonthAssetRule {
	现金及活期存款("AMT1_1_1","1.1.1 现金及活期存款","ASSETTYPE2","1001"),//现金及活期存款待定
	本行存款("AMT1_1_2","1.1.2 本行存款","ASSETTYPE2","1002"),
	他行存款("AMT1_1_3","1.1.3 他行存款","ASSETTYPE2","1003"),
	本行发行的大额存单("AMT1_1_4","1.1.4 本行发行的大额存单","ASSETTYPE2","1004"),
	他行发行的大额存单("AMT1_1_5","1.1.5 他行发行的大额存单","ASSETTYPE2","1005"),
	合计1_1_6("AMT1_1_6","1.1.6 合计","",""),
	本行发行的同业存单("AMT1_2_1","1.2.1 本行发行的同业存单","ASSETTYPE2","2501"),
	他行发行的同业存单("AMT1_2_2","1.2.2 他行发行的同业存单","ASSETTYPE2","2502"),
	合计1_2_3("AMT1_2_3","1.2.3 合计","",""),
	拆放同业("AMT1_3_1","1.3.1 拆放同业","ASSETTYPE2","1107"),
	买入返售("AMT1_3_2","1.3.2 买入返售","ASSETTYPE2","1108"),
	合计1_3_3("AMT1_3_3","1.3.3 合计","",""),
	国债("AMT1_4_1","1.4.1 国债","ASSETTYPE2","1101"),
	地方政府债券("AMT1_4_2","1.4.2 地方政府债券","ASSETTYPE2","1110"),
	中央银行票据("AMT1_4_3","1.4.3 中央银行票据","ASSETTYPE2","1109"),
	政府机构债券("AMT1_4_4","1.4.4 政府机构债券","ASSETTYPE2","1111"),
	政策性金融债券("AMT1_4_5","1.4.5 政策性金融债券","ASSETTYPE2","1102"),
	商业性金融债券("AMT1_4_6","1.4.6 商业性金融债券","ASSETTYPE2","1112"),
	企业债券("AMT1_4_7","1.4.7 企业债券","ASSETTYPE2","1113"),
	公司债券("AMT1_4_8","1.4.8 公司债券","ASSETTYPE2","1114"),
	企业债务融资工具("AMT1_4_9","1.4.9 企业债务融资工具","ASSETTYPE2","1115"),
	资产支持证券("AMT1_4_10","1.4.10 资产支持证券","ASSETTYPE2","1116"),
	外国债券不含QDII债券("AMT1_4_11","1.4.11 外国债券（不含QDII债券）","ASSETTYPE2","1117"),
//	其他债券("AMT1_4_12","1.4.12 其他债券","",""),
	合计1_4_13("AMT1_4_13","1.4.13 合计","",""),
	信用债券1_4_a("AMT1_4_a","其中: 1.4.a AA+（含）以上信用债券","RATINGAA+","AA+"),
	信用债券1_4_b("AMT1_4_b","1.4.b AA+以下信用债券","RATINGAA-","AA+"),
	无评级信用债券("AMT1_4_c","1.4.c 无评级信用债券","RATINGNUll","NULL"),
	理财直接融资工具("AMT1_5_1","1.5.1 理财直接融资工具","ASSETTYPE2","2101"),
//	其他理财直接融资工具("AMT1_5_2","1.5.2 其他理财直接融资工具","",""),
	合计1_5_3("AMT1_5_3","1.5.3 合计","",""),
	信贷资产收益权转让("AMT1_6_1","1.6.1 信贷资产收益权转让","ASSETTYPE2","2201"),
	小微企业信贷资产流转和收益权转让("AMT1_6_2","1.6.2 小微企业信贷资产流转和收益权转让","ASSETTYPE2","2202"),
	其他新增可投资资产("AMT1_6_3","1.6.3 其他新增可投资资产","ASSETTYPE2","2299"),
	合计1_6_4("AMT1_6_4","1.6.4 合计","",""),
	票据类("AMT1_7_1","1.7.1 票据类","ASSETTYPE2","1201"),
	信用证("AMT1_7_2","1.7.2 信用证","ASSETTYPE2","1210"),
	信托贷款("AMT1_7_3","1.7.3 信托贷款","ASSETTYPE2","1202"),
	委托贷款("AMT1_7_4","1.7.4 委托贷款","ASSETTYPE2","1203"),
	信贷资产转让("AMT1_7_5","1.7.5 信贷资产转让","ASSETTYPE2","1204"),
	收受益权1_7_6("AMT1_7_6","1.7.6 收/受益权","ASSETTYPE2","1205"),
	委托债权("AMT1_7_7","1.7.7 委托债权","ASSETTYPE2","1206"),
	应收账款("AMT1_7_8","1.7.8 应收账款","ASSETTYPE2","1207"),
	带回购条款的股权性融资("AMT1_7_9","1.7.9 带回购条款的股权性融资","ASSETTYPE2","1208"),
	债权融资类产品("AMT1_7_10","1.7.10 债权融资类产品","ASSETTYPE2","1209"),
	其他非标准化债权类投资("AMT1_7_11","1.7.11 其他非标准化债权类投资","ASSETTYPE2","1299"),
	场内股票质押回购("AMT1_7_11_a","其中：1.7.11.a 场内股票质押回购","ASSETTYPE2,INASSETTYPE","1299,01"),
	场外股票质押融资("AMT1_7_11_b","1.7.11.b 场外股票质押融资","ASSETTYPE2,INASSETTYPE","1299,02"),
	合计1_7_12("AMT1_7_12","1.7.12 合计","",""),
	投向地方政府融资平台的部分("AMT1_7_a","其中：1.7.a 投向地方政府融资平台的部分","ASSETTYPE2,MONITTYPE","1201|1210|1202|1203|1204|1205|1206|1207|1208|1209|1299,01"),
	股权("AMT1_8_1","1.8.1 股权","ASSETTYPE2","1301"),
	股票一级市场("AMT1_8_2","1.8.2 股票（一级市场）","ASSETTYPE2","1305"),
	股票二级市场("AMT1_8_3","1.8.3 股票（二级市场）","ASSETTYPE2","1302"),
	其他权益类投资("AMT1_8_4","1.8.4 其他权益类投资","ASSETTYPE2","1399"),
	合计1_8_5("AMT1_8_5","1.8.5 合计","",""),
	远期("AMT1_9_1","1.9.1 远期","ASSETTYPE2","1401"),
	互换("AMT1_9_2","1.9.2 互换","ASSETTYPE2","1402"),
	期货("AMT1_9_3","1.9.3 期货","ASSETTYPE2","1403"),
	期权("AMT1_9_4","1.9.4 期权","ASSETTYPE2","1404"),
	债券借贷("AMT1_9_5","1.9.5 债券借贷","ASSETTYPE2","1405"),
	权证("AMT1_9_6","1.9.6 权证","ASSETTYPE2","1406"),
	其他金融衍生品("AMT1_9_7","1.9.7 其他金融衍生品","ASSETTYPE2","1499"),
	合计1_9_8("AMT1_9_8","1.9.8 合计","",""),
	QDII债券("AMT1_10_1","1.10.1 QDII债券","ASSETTYPE2","1501"),
	QDII拆出("AMT1_10_2","1.10.2 QDII拆出","ASSETTYPE2","1504"),
	QDII逆回购("AMT1_10_3","1.10.3 QDII逆回购","ASSETTYPE2","1506"),
	QDII债券型基金("AMT1_10_4","1.10.4 QDII债券型基金","ASSETTYPE2","1507"),
	QDII货币型基金("AMT1_10_5","1.10.5 QDII货币型基金","ASSETTYPE2","1508"),
	QDII混合型基金("AMT1_10_6","1.10.6 QDII混合型基金","ASSETTYPE2","1509"),
	QDII股票型基金("AMT1_10_7","1.10.7 QDII股票型基金","ASSETTYPE2","1505"),
	QDII股票("AMT1_10_8","1.10.8 QDII股票","ASSETTYPE2","1502"),
	QDII结构性票据("AMT1_10_9","1.10.9 QDII结构性票据","ASSETTYPE2","1503"),
	其他代客境外理财投资QDII("AMT1_10_10","1.10.10 其他代客境外理财投资QDII","ASSETTYPE2","1599"),
	合计1_10_11("AMT1_10_11","1.10.11 合计","",""),
	贵金属类("AMT1_11_1","1.11.1 贵金属类","ASSETTYPE2","1601"),
	大宗商品类("AMT1_11_2","1.11.2 大宗商品类","ASSETTYPE2","1602"),
	其他商品类资产("AMT1_11_3","1.11.3 其他商品类资产","ASSETTYPE2","1699"),
	合计1_11_4("AMT1_11_4","1.11.4 合计","",""),
	字画类艺术品("AMT1_12_1","1.12.1 字画类艺术品","ASSETTYPE2","2301"),
	古董类艺术品("AMT1_12_2","1.12.2 古董类艺术品","ASSETTYPE2","2302"),
	其他类艺术品("AMT1_12_3","1.12.3 其他类艺术品","ASSETTYPE2","2303"),
	影视等知识产权("AMT1_12_4","1.12.4 影视等知识产权","ASSETTYPE2","2304"),
	酒("AMT1_12_5","1.12.5 酒","ASSETTYPE2","2305"),
	其他另类资产("AMT1_12_6","1.12.6 其他另类资产","ASSETTYPE2","1603"),
	合计1_12_7("AMT1_12_7","1.12.7 合计","",""),
	债券基金("AMT1_13_1","1.13.1 债券基金","ASSETTYPE2","1106"),
	货币市场基金("AMT1_13_2","1.13.2 货币市场基金","ASSETTYPE2","2401"),
	股票基金("AMT1_13_3","1.13.3 股票基金","ASSETTYPE2","1303"),
	基金中基金("AMT1_13_4","1.13.4 基金中基金","ASSETTYPE2","2403"),
	混合基金("AMT1_13_5","1.13.5 混合基金","ASSETTYPE2","2402"),
	其他公募基金("AMT1_13_6","1.13.6 其他公募基金","ASSETTYPE2","2499"),
	合计1_13_7("AMT1_13_7","1.13.7 合计","",""),
	私募证券投资基金("AMT1_14_1","1.14.1 私募证券投资基金","ASSETTYPE2","2601|2602|2604|2605|2606"),
	权益类基金("AMT1_14_1_1","其中：1.14.1.1 权益类基金","ASSETTYPE2","2601"),
	固收类基金("AMT1_14_1_2","1.14.1.2 固收类基金","ASSETTYPE2","2602"),
	混合类基金("AMT1_14_1_3","1.14.1.3 混合类基金","ASSETTYPE2","2604"),
	期货类及其他衍生品类基金("AMT1_14_1_4","1.14.1.4 期货类及其他衍生品类基金","ASSETTYPE2","2605"),
	其他类基金1_14_1_5("AMT1_14_1_5","1.14.1.5 其他类基金","ASSETTYPE2","2606"),
	私募股权投资基金("AMT1_14_2","1.14.2 私募股权投资基金","ASSETTYPE2","2607|2610|2611|2612|2617"),
	上市公司定增基金("AMT1_14_2_1","其中：1.14.2.1 上市公司定增基金","ASSETTYPE2","2607"),
	并购基金("AMT1_14_2_2","1.14.2.2 并购基金","ASSETTYPE2","2610"),
	房地产基金("AMT1_14_2_3","1.14.2.3 房地产基金","ASSETTYPE2","2611"),
	基础设施基金("AMT1_14_2_4","1.14.2.4 基础设施基金","ASSETTYPE2","2612"),
	其他类基金1_14_2_5("AMT1_14_2_5","1.14.2.5 其他类基金","ASSETTYPE2","2617"),
	创业投资基金("AMT1_14_3","1.14.3 创业投资基金","ASSETTYPE2","2613"),
	其他私募投资基金("AMT1_14_4","1.14.4 其他私募投资基金","ASSETTYPE2","2699"),
	私募证券类FOF基金("AMT1_14_5","1.14.5 私募证券类FOF基金","ASSETTYPE2","2616"),
	私募股权投资类FOF基金("AMT1_14_6","1.14.6 私募股权投资类FOF基金","ASSETTYPE2","2618"),
	创业投资类FOF基金("AMT1_14_7","1.14.7 创业投资类FOF基金","ASSETTYPE2","2619"),
	其他私募投资类FOF基金("AMT1_14_8","1.14.8 其他私募投资类FOF基金","ASSETTYPE2","2620"),
	合计1_14_9("AMT1_14_9","1.14.9 合计","",""),
	其中投向金融资产投资公司或其附属机构发行的私募股权投资基金AMT1_14_9_a("AMT1_14_9_a","其中：1.14.9.a投向金融资产投资公司或其附属机构发行的私募股权投资基金",
			"ASSETTYPE2,PRIVATEFUNDFLAG","2601|2602|2604|2605|2606|2607|2610|2611|2612|2617|2613|2699|2616|2618|2619|2620,01"),
	信托产品("AMT1_15_1","1.15.1 信托产品","ASSETTYPE2","1701"),
	自主管理1_15_1_1("AMT1_15_1_1","其中:1.15.1.1 自主管理","ASSETTYPE2,MANAGETYPE","1701,01"),
	委托管理1_15_1_2("AMT1_15_1_2","1.15.1.2 委托管理","ASSETTYPE2,MANAGETYPE","1701,02|99"),
	券商资产管理产品("AMT1_15_2","1.15.2 券商资产管理产品","ASSETTYPE2","1703"),
	自主管理1_15_2_1("AMT1_15_2_1","其中:1.15.2.1 自主管理","ASSETTYPE2,MANAGETYPE","1703,01"),
	委托管理1_15_2_2("AMT1_15_2_2","1.15.2.2 委托管理","ASSETTYPE2,MANAGETYPE","1703,02|99"),
	基金资产管理产品("AMT1_15_3","1.15.3 基金资产管理产品","ASSETTYPE2","1704"),
	自主管理1_15_3_1("AMT1_15_3_1","其中:1.15.3.1 自主管理","ASSETTYPE2,MANAGETYPE","1704,01"),
	委托管理1_15_3_2("AMT1_15_3_2","1.15.3.2 委托管理","ASSETTYPE2,MANAGETYPE","1704,02|99"),
	期货资产管理产品("AMT1_15_4","1.15.4 期货资产管理产品","ASSETTYPE2","1706"),
	自主管理1_15_4_1("AMT1_15_4_1","其中:1.15.4.1 自主管理","ASSETTYPE2,MANAGETYPE","1706,01"),
	委托管理1_15_4_2("AMT1_15_4_2","1.15.4.2 委托管理","ASSETTYPE2,MANAGETYPE","1706,02|99"),
	保险资产管理产品("AMT1_15_5","1.15.5 保险资产管理产品","ASSETTYPE2","1702"),
	自主管理1_15_5_1("AMT1_15_5_1","其中:1.15.5.1 自主管理","ASSETTYPE2,MANAGETYPE","1702,01"),
	委托管理1_15_5_2("AMT1_15_5_2","1.15.5.2 委托管理","ASSETTYPE2,MANAGETYPE","1702,02|99"),
	其他资产管理产品("AMT1_15_6","1.15.6 其他资产管理产品","ASSETTYPE2","1705"),
	自主管理1_15_6_1("AMT1_15_6_1","其中:1.15.6.1 自主管理","ASSETTYPE2,MANAGETYPE","1705,01"),
	委托管理1_15_6_2("AMT1_15_6_2","1.15.6.2 委托管理","ASSETTYPE2,MANAGETYPE","1705,02|99"),
	合计1_15_7("AMT1_15_7","1.15.7 合计","",""),
	其中投向金融资产投资公司发行的私募资产管理产品1_15_7_a("AMT1_15_7_a","其中：1.15.7.a投向金融资产投资公司发行的私募资产管理产品","ASSETTYPE2,PRIVATEPRDFLAG","1701|1702|1703|1704|1705|1706,01"),
	银行("AMT1_16_1","1.16.1 银行","ASSETTYPE2","2801"),
	信托公司("AMT1_16_2","1.16.2 信托公司","ASSETTYPE2","2802"),
	证券公司("AMT1_16_3","1.16.3 证券公司","ASSETTYPE2","2803"),
	基金公司("AMT1_16_4","1.16.4 基金公司","ASSETTYPE2","2804"),
	期货公司("AMT1_16_5","1.16.5 期货公司","ASSETTYPE2","2805"),
	保险公司("AMT1_16_6","1.16.6 保险公司","ASSETTYPE2","2806"),
	其他1_16_7("AMT1_16_7","1.16.7 其他","ASSETTYPE2","2899"),
	合计1_16_8("AMT1_16_8","1.16.8 合计","",""),
	合计1_17("AMT1_17","1.17 合计","",""),
	投向公共私营合作项目PPP的部分("AMT1_17_a","其中：1.17.a 投向“公共私营合作项目”（PPP）的部分","ASSETTYPE2,ASSETTYPE2,ASSETTYPE2,PPPFLAG","!1901,!1902,!2000,01"),
	投向市场化债转股相关产品的部分("AMT1_17_b","其中：1.17.b 投向市场化债转股相关产品的部分","ASSETTYPE2,ASSETTYPE2,ASSETTYPE2,BONDTOSTOCKFLAG","!1901,!1902,!2000,01"),
	商业银行二级资本债("AMT1_17_c","其中：1.17.c 商业银行二级资本债","ASSETTYPE2,ASSETTYPE2,ASSETTYPE2,BANKSECCAPITAL","!1901,!1902,!2000,01"),
	商业银行永续债("AMT1_17_d","其中：1.17.d 商业银行永续债","ASSETTYPE2,ASSETTYPE2,ASSETTYPE2,BANKSECPERPETUAL","!1901,!1902,!2000,01"),
	商业银行优先股("AMT1_17_e","其中：1.17.e 商业银行优先股","ASSETTYPE2,ASSETTYPE2,ASSETTYPE2,BANKSECPREFER","!1901,!1902,!2000,01"),

	
	同业拆入("AMT2_1_1","2.1.1 同业拆入","ASSETTYPE2","1901"),
	卖出回购("AMT2_1_2","2.1.2 卖出回购","ASSETTYPE2","1902"),
	合计2_1_3("AMT2_1_3","2.1.3 合计","",""),
	其他负债("AMT2_2","2.2 其他(负债）","ASSETTYPE2","2000"),
	合计2_3("AMT2_3","2.3 合计","",""),
	政府投资基金("AMT3_1","3.1 政府投资基金","ISGOVERNFUND1","01"),
	农林牧渔业("AMT3_2_1","3.2.1 农林牧渔业","ASSETTYPE2,INDUSTRY1","1201|1210|1202|1203|1204|1205|1206|1207|1208|1209|1299,01"),
	制造业("AMT3_2_2","3.2.2 制造业","ASSETTYPE2,INDUSTRY1","1201|1210|1202|1203|1204|1205|1206|1207|1208|1209|1299,03"),
	采矿业("AMT3_2_3","3.2.3 采矿业","ASSETTYPE2,INDUSTRY1","1201|1210|1202|1203|1204|1205|1206|1207|1208|1209|1299,02"),
	建筑业("AMT3_2_4","3.2.4 建筑业","ASSETTYPE2,INDUSTRY1","1201|1210|1202|1203|1204|1205|1206|1207|1208|1209|1299,05"),
	基础设施建设("AMT3_2_5","3.2.5 基础设施建设","ASSETTYPE2,INDUSTRY1","1201|1210|1202|1203|1204|1205|1206|1207|1208|1209|1299,04|07|14"),
	房地产业("AMT3_2_6","3.2.6 房地产业","ASSETTYPE2,INDUSTRY1","1201|1210|1202|1203|1204|1205|1206|1207|1208|1209|1299,11"),
	金融业("AMT3_2_7","3.2.7 金融业","ASSETTYPE2,INDUSTRY1","1201|1210|1202|1203|1204|1205|1206|1207|1208|1209|1299,10"),
	其他服务业("AMT3_2_8","3.2.8 其他服务业","ASSETTYPE2,INDUSTRY1","1201|1210|1202|1203|1204|1205|1206|1207|1208|1209|1299,06|08|09|12|13|15|16|17|18|19|20|NULL"),
	合计3_2_9("AMT3_2_9","3.2.9 合计","",""),
	;
	/**
	 * 属性代码 
	 */
	private String propertyCode;
	
	/**
	 * 属性名称
	 */
	private String propertyName;
	
	/**
	 * 属性映射规则列表，关联chb_month_asset_position中的字段名,以逗号隔开
	 */
	private List<String> ruleCodeList;
	
	/**
	 * 属性映射规则值，与属性映射规则列表中对应的取值
	 */
	private List<String> ruleValueList;

	ChbMonthAssetRule(String propertyCode,String propertyName,String ruleCodeList,String ruleValueList){
		this.propertyCode = propertyCode;
		this.propertyName = propertyName;
		this.ruleCodeList = StringUtil.splitToList(GlobalConstant.COMMA, ruleCodeList);
		this.ruleValueList = StringUtil.splitToList(GlobalConstant.COMMA, ruleValueList);
	}
	
	public String getPropertyCode() {
		return propertyCode;
	}

	public void setPropertyCode(String propertyCode) {
		this.propertyCode = propertyCode;
	}

	public String getPropertyName() {
		return propertyName;
	}

	public void setPropertyName(String prepertyName) {
		this.propertyName = prepertyName;
	}

	public List<String> getRuleCodeList() {
		return ruleCodeList;
	}

	public void setRuleCodeList(List<String> ruleCodeList) {
		this.ruleCodeList = ruleCodeList;
	}

	public List<String> getRuleValueList() {
		return ruleValueList;
	}

	public void setRuleValueList(List<String> ruleValueList) {
		this.ruleValueList = ruleValueList;
	}

	
}
