/*
 * 文件名：AssetLiabilityStatementEnum.java
 * 版权：Copyright 2017-2018 JoyinTech. Co. Ltd. All Rights Reserved.
 * 描述：理财资管管理系统V2.0
 * 修改人：zhangwei
 * 修改时间：2018年9月19日
 * 修改内容：新建
 * 系统名称：理财资管管理系统V2.0
 */

package com.joyintech.tams.valuation.financialstatement.assetliailitystatement.common;

import java.io.Serializable;
import java.util.ArrayList;
import java.util.List;

import org.apache.commons.lang3.StringUtils;

import com.google.common.collect.Lists;
import com.joyintech.tams.constant.DictCodeList;
import com.joyintech.tams.constant.DictCodeListExt2;
import com.joyintech.tams.constant.DictCodeListExt1;

/**
 * 资产负债表枚举 （科目类别， 科目号， 资产名，科目名）
 * 
 * @author zhangwei
 * @version 1.0 2018年9月19日
 * @see AssetLiabilityStatementEnum
 * @since 1.0
 */
public enum AssetLiabilityStatementEnum implements Serializable {

    资产类_银行存款(DictCodeList.科目类型_资产类, "1002", "银行存款", "银行存款", "01"),

    资产类_结算备付金(DictCodeList.科目类型_资产类, "1021", "结算备付金", "结算备付金", "01"),

    资产类_存出保证金(DictCodeList.科目类型_资产类, "1031", "存出保证金", "存出保证金", "01"),

    资产类_存放同业款项(DictCodeList.科目类型_资产类, "100301", "存放同业款项", "存放同业-一般款项", "01"),

    资产类_拆出资金(DictCodeList.科目类型_资产类, "100302", "拆出资金", "拆放同业-同业借款", "01"),

    资产类_买入返售金融资产(DictCodeList.科目类型_资产类, "1202", "买入返售金融资产", "买入返售金融资产", "01"),

    资产类_衍生金融资产_外汇买卖(DictCodeList.科目类型_资产类, "3101", "衍生金融资产", "外汇买卖", "01"),

    资产类_衍生金融资产_外汇结售汇(DictCodeList.科目类型_资产类, "3102", "衍生金融资产", "外汇结售汇", "01"),

    资产类_衍生金融资产_金融掉期(DictCodeList.科目类型_资产类, "3103", "衍生金融资产", "金融掉期", "01"),

    资产类_衍生金融资产_远期投资(DictCodeList.科目类型_资产类, "3104", "衍生金融资产", "远期投资", "01"),

    /** add by yanya on 20200219 邮储资产负债表增加期权 start**/
    资产类_衍生金融资产_股票期权(DictCodeList.科目类型_资产类, "310601", "衍生金融资产", "股票期权", "01"),
    资产类_衍生金融资产_买入个股期权(DictCodeList.科目类型_资产类, "310602", "衍生金融资产", "买入个股期权", "01"),
    资产类_衍生金融资产_买入指数期权(DictCodeList.科目类型_资产类, "310603", "衍生金融资产", "买入指数期权", "01"),
    资产类_衍生金融资产_买入期货期权(DictCodeList.科目类型_资产类, "310604", "衍生金融资产", "买入期货期权", "01"),
    /** add by yanya on 20200219 邮储资产负债表增加期权 end**/

    资产类_衍生金融资产_其他衍生工具(DictCodeList.科目类型_资产类, "3111", "衍生金融资产", "其他衍生工具", "01"),

    资产类_衍生金融资产_套期工具(DictCodeList.科目类型_资产类, "3201", "衍生金融资产", "套期工具", "01"),

    资产类_衍生金融资产_被套期项目(DictCodeList.科目类型_资产类, "3202", "衍生金融资产", "被套期项目", "01"),

    资产类_以公允价值计量且其变动计入当期损益的金融资产_以公允价值计量且其变动计入当期损益类债券投资(DictCodeList.科目类型_资产类, "1103", "以公允价值计量且其变动计入当期损益的金融资产",
            "以公允价值计量且其变动计入当期损益类债券投资", "01"),

    资产类_以公允价值计量且其变动计入当期损益的金融资产_公允价值损益类_基金投资(DictCodeList.科目类型_资产类, "1105", "以公允价值计量且其变动计入当期损益的金融资产", "公允价值损益类-基金投资", "01"),

    资产类_以公允价值计量且其变动计入当期损益的金融资产_公允价值损益类_计划类资产投资(DictCodeList.科目类型_资产类, "1107", "以公允价值计量且其变动计入当期损益的金融资产",
            "公允价值损益类-计划类资产投资", "01"),

    资产类_以公允价值计量且其变动计入当期损益的金融资产_公允价值损益类_股票投资(DictCodeList.科目类型_资产类, "1108", "以公允价值计量且其变动计入当期损益的金融资产", "公允价值损益类-股票投资", "01"),

    资产类_以公允价值计量且其变动计入其他综合收益的金融资产_以公允价值且其变动计入其他综合收益类债券投资(DictCodeList.科目类型_资产类, "1104", "以公允价值计量且其变动计入其他综合收益的金融资产",
        "以公允价值且其变动计入其他综合收益类债券投资", "01"),

    资产类_以公允价值计量且其变动计入其他综合收益的金融资产_公允价值损益类_计划类货币型资产投资(DictCodeList.科目类型_资产类, "1110", "以公允价值计量且其变动计入当期损益的金融资产",
            "公允价值损益类-计划类（货币型）资产投资", "01"),

    资产类_以摊余成本计量的金融资产_摊余成本类债券投资(DictCodeList.科目类型_资产类, "1102", "以摊余成本计量的金融资产", "摊余成本类债券投资", "01"),

    资产类_以摊余成本计量的金融资产_摊余成本类_计划类资产投资(DictCodeList.科目类型_资产类, "1106", "以摊余成本计量的金融资产", "摊余成本类-计划类资产投资", "01"),

    资产类_应收利息_应收利息(DictCodeList.科目类型_资产类, "1204", "应收利息", "应收利息", "01"),

    资产类_应收利息_非上市债券应收利息(DictCodeList.科目类型_资产类, "1205", "应收利息", "非上市债券应收利息", "01"),

    资产类_应收证券清算款(DictCodeList.科目类型_资产类, "3003", "应收证券清算款", "证券清算款", "01"),

    资产类_应收红利(DictCodeList.科目类型_资产类, "1203", "应收红利", "应收红利", "01"),

    资产类_应收申购款(DictCodeList.科目类型_资产类, "1207", "应收申购款", "应收申购款", "01"),

    资产类_其他资产_非上市债券成本(DictCodeList.科目类型_资产类, "1109", "其他资产", "非上市债券成本", "01"),

    资产类_其他资产_其他应收款(DictCodeList.科目类型_资产类, "1221", "其他资产", "其他应收款", "01"),

    资产类_其他资产_资产减值准备(DictCodeList.科目类型_资产类, "1302", "其他资产", "资产减值准备", "01"),

    资产类_其他资产_坏账准备(DictCodeList.科目类型_资产类, "1303", "其他资产", "坏账准备", "01"),

    资产类_其他资产_应收逾期款(DictCodeList.科目类型_资产类, "1304", "其他资产", "应收逾期款", "01"),

    资产类_其他资产_待摊费用(DictCodeList.科目类型_资产类, "1501", "其他资产", "待摊费用", "01"),

    资产类_其他资产_应付账款(DictCodeList.科目类型_资产类, "3004", "其他资产", "应付账款", "01"),

    负债类_拆入资金(DictCodeList.科目类型_负债类, "2001", "拆入资金", "拆入款项", "01"),

    负债类_以公允价值计量且其变动计入当期损益的金融负债(DictCodeList.科目类型_负债类, "2101", "以公允价值计量且其变动计入当期损益的金融负债", "以公允价值计量且其变动计入当期损益类金融负债", "01"),

    负债类_衍生金融负债_外汇买卖(DictCodeList.科目类型_负债类, "3101", "衍生金融负债", "外汇买卖", "01"),

    负债类_衍生金融负债_外汇结售汇(DictCodeList.科目类型_负债类, "3102", "衍生金融负债", "外汇结售汇", "01"),

    负债类_衍生金融负债_金融掉期(DictCodeList.科目类型_负债类, "3103", "衍生金融负债", "金融掉期", "01"),

    负债类_衍生金融负债_远期投资(DictCodeList.科目类型_负债类, "3104", "衍生金融负债", "远期投资", "01"),

    负债类_衍生金融负债_期货投资(DictCodeList.科目类型_负债类, "3105", "衍生金融负债", "期货投资", "01"),

    /** add by yanya on 20200219 邮储资产负债表增加期权 start**/
    负债类_衍生金融负债_股票期权(DictCodeList.科目类型_负债类, "310601", "衍生金融负债", "股票期权", "01"),
    负债类_衍生金融负债_卖出个股期权(DictCodeList.科目类型_负债类, "310605", "衍生金融负债", "卖出个股期权", "01"),
    负债类_衍生金融负债_卖出指数期权(DictCodeList.科目类型_负债类, "310606", "衍生金融负债", "卖出指数期权", "01"),
    负债类_衍生金融负债_卖出期货期权(DictCodeList.科目类型_负债类, "310607", "衍生金融负债", "卖出期货期权", "01"),
    /** add by yanya on 20200219 邮储资产负债表增加期权 end**/

    负债类_衍生金融负债_其他衍生工具(DictCodeList.科目类型_负债类, "3111", "衍生金融负债", "其他衍生工具", "01"),

    负债类_衍生金融负债_套期工具(DictCodeList.科目类型_负债类, "3201", "衍生金融负债", "套期工具", "01"),

    负债类_衍生金融负债_被套期项目(DictCodeList.科目类型_负债类, "3202", "衍生金融负债", "被套期项目", "01"),

    负债类_卖出回购金融资产款(DictCodeList.科目类型_负债类, "2202", "卖出回购金融资产款", "卖出回购金融资产款", "01"),

    负债类_应付管理人报酬(DictCodeList.科目类型_负债类, "2206", "应付管理人报酬", "应付管理人报酬", "01"),

    负债类_应付交易费用(DictCodeList.科目类型_负债类, "2209", "应付交易费用", "应付交易费用", "01"),

    负债类_应付托管费(DictCodeList.科目类型_负债类, "2207", "应付托管费", "应付托管费", "01"),

    负债类_应付销售服务费(DictCodeList.科目类型_负债类, "2208", "应付销售服务费", "应付销售服务费", "01"),

    负债类_应付利息(DictCodeList.科目类型_负债类, "2231", "应付利息", "应付利息", "01"),

    负债类_应付赎回款(DictCodeList.科目类型_负债类, "2203", "应付赎回款", "应付赎回款", "01"),

    负债类_应付证券清算款(DictCodeList.科目类型_负债类, "3003", "应付证券清算款", "证券清算款", "01"),

    负债类_应付利润(DictCodeList.科目类型_负债类, "2232", "应付利润", "应付利润", "01"),

    负债类_其他负债_应付赎回费(DictCodeList.科目类型_负债类, "2204", "其他负债", "应付赎回费", "01"),

    负债类_其他负债_应付代销费(DictCodeList.科目类型_负债类, "2210", "其他负债", "应付代销费", "01"),

    负债类_其他负债_应付外包服务费(DictCodeList.科目类型_负债类, "2211", "其他负债", "应付外包服务费", "01"),

    负债类_其他负债_应付投顾费(DictCodeList.科目类型_负债类, "2205", "其他负债", "应付投顾费", "01"),

    负债类_其他负债_应付推介费(DictCodeList.科目类型_负债类, "2212", "其他负债", "应付推介费", "01"),

    负债类_其他负债_合作方应交税费(DictCodeList.科目类型_负债类, "2213", "其他负债", "合作方应交税费", "01"),

    负债类_其他负债_应交税费(DictCodeList.科目类型_负债类, "2221", "其他负债", "应交税费", "01"),

    负债类_其他负债_应付账款(DictCodeList.科目类型_负债类, "3004", "其他负债", "应付账款", "01"),

    负债类_其他负债_待清算资金(DictCodeList.科目类型_负债类, "2233", "其他负债", "待清算资金", "01"),

    负债类_其他负债_其他应付款(DictCodeList.科目类型_负债类, "2241", "其他负债", "其他应付款", "01"),

    负债类_其他负债_预提费用(DictCodeList.科目类型_负债类, "2501", "其他负债", "预提费用", "01"),

    所有者权益类_实收资本(DictCodeList.科目类型_所有者权益类, "4001", "实收资本", "实收资本", "01"),

    所有者权益类_资本公积(DictCodeList.科目类型_所有者权益类, "4002", "资本公积", "资本公积", "01"),

    所有者权益类_其他综合收益(DictCodeList.科目类型_所有者权益类, "4003", "其他综合收益", "其他综合收益", "01"),

    所有者权益类_未分配利润_利息收入(DictCodeList.科目类型_所有者权益类, "6011", "未分配利润", "利息收入", "01"),

    所有者权益类_未分配利润_公允价值变动损益(DictCodeList.科目类型_所有者权益类, "6101", "未分配利润", "公允价值变动损益", "01"),

    所有者权益类_未分配利润_投资收益(DictCodeList.科目类型_所有者权益类, "6111", "未分配利润", "投资收益", "01"),

    所有者权益类_未分配利润_汇兑损益(DictCodeList.科目类型_所有者权益类, "6112", "未分配利润", "汇兑损益", "01"),

    所有者权益类_未分配利润_其他收入(DictCodeList.科目类型_所有者权益类, "6302", "未分配利润", "其他收入", "01"),

    所有者权益类_未分配利润_管理人报酬(DictCodeList.科目类型_所有者权益类, "6403", "未分配利润", "管理人报酬", "01"),

    所有者权益类_未分配利润_托管费(DictCodeList.科目类型_所有者权益类, "6404", "未分配利润", "托管费", "01"),

    所有者权益类_未分配利润_销售服务费(DictCodeList.科目类型_所有者权益类, "6406", "未分配利润", "销售服务费", "01"),

    所有者权益类_未分配利润_代销费(DictCodeList.科目类型_所有者权益类, "6409", "未分配利润", "代销费", "01"),

    所有者权益类_未分配利润_外包服务费(DictCodeList.科目类型_所有者权益类, "6410", "未分配利润", "外包服务费", "01"),

    所有者权益类_未分配利润_交易费用(DictCodeList.科目类型_所有者权益类, "6407", "未分配利润", "交易费用", "01"),

    所有者权益类_未分配利润_税费支出(DictCodeList.科目类型_所有者权益类, "6408", "未分配利润", "税费支出", "01"),

    所有者权益类_未分配利润_利息支出(DictCodeList.科目类型_所有者权益类, "6411", "未分配利润", "利息支出", "01"),

    所有者权益类_未分配利润_资产减值损失(DictCodeList.科目类型_所有者权益类, "6412", "未分配利润", "资产减值损失", "01"),

    所有者权益类_未分配利润_推介费支出(DictCodeList.科目类型_所有者权益类, "6413", "未分配利润", "推介费支出", "01"),

    所有者权益类_未分配利润_合作方应交税费支出(DictCodeList.科目类型_所有者权益类, "6414", "未分配利润", "合作方应交税费支出", "01"),

    所有者权益类_未分配利润_其他费用(DictCodeList.科目类型_所有者权益类, "6605", "未分配利润", "其他费用", "01"),

    所有者权益类_未分配利润_其他支出(DictCodeList.科目类型_所有者权益类, "6702", "未分配利润", "其他支出", "01"),

    所有者权益类_未分配利润_以前年度损益调整(DictCodeList.科目类型_所有者权益类, "6901", "未分配利润", "以前年度损益调整", "01"),

    所有者权益类_未分配利润_损益平准金(DictCodeList.科目类型_所有者权益类, "4011", "未分配利润", "损益平准金", "01"),

    所有者权益类_未分配利润_本期利润(DictCodeList.科目类型_所有者权益类, "4103", "未分配利润", "本期利润", "01"),

    所有者权益类_未分配利润_利润分配(DictCodeList.科目类型_所有者权益类, "4104", "未分配利润", "利润分配", "01"),

    特殊处理C_所有者权益类_其他综合收益(DictCodeList.科目类型_所有者权益类, "SD_C_4003", "其他综合收益", "其他综合收益", "01"),
    特殊处理D_所有者权益类_其他综合收益(DictCodeList.科目类型_所有者权益类, "SD_D_4003", "其他综合收益", "其他综合收益", "01"),
    
    资产类_银行存款_02(DictCodeList.科目类型_资产类, "1002", "银行存款", "银行存款", "02"),

    资产类_结算备付金_02(DictCodeList.科目类型_资产类, "1021", "结算备付金", "结算备付金", "02"),

    资产类_存出保证金_02(DictCodeList.科目类型_资产类, "1031", "存出保证金", "存出保证金", "02"),
    
    资产类_资金同业款_02(DictCodeList.科目类型_资产类, "1003", "资金同业款项", "资金同业款", "02"),
    
    资产类_拆放款项减值准备_02(DictCodeList.科目类型_资产类, "130204", "资金同业款项", "拆放款项减值准备", "02"),
    
    资产类_存放款项减值准备_02(DictCodeList.科目类型_资产类, "130205", "资金同业款项", "存放款项减值准备", "02"),

    //资产类_存放同业款项_02(DictCodeList.科目类型_资产类, "100301", "存放同业款项", "存放同业-一般款项", "02"),

    //资产类_拆出资金_02(DictCodeList.科目类型_资产类, "100302", "拆出资金", "拆放同业-同业借款", "02"),

    资产类_买入返售金融资产_02(DictCodeList.科目类型_资产类, "1202", "买入返售金融资产", "买入返售金融资产", "02"),

    资产类_衍生金融资产_外汇买卖_02(DictCodeList.科目类型_资产类, "3101", "衍生金融资产", "外汇买卖", "02"),

    资产类_衍生金融资产_外汇结售汇_02(DictCodeList.科目类型_资产类, "3102", "衍生金融资产", "外汇结售汇", "02"),

    资产类_衍生金融资产_金融掉期_02(DictCodeList.科目类型_资产类, "3103", "衍生金融资产", "金融掉期", "02"),

    资产类_衍生金融资产_远期投资_02(DictCodeList.科目类型_资产类, "3104", "衍生金融资产", "远期投资", "02"),

    /** add by yanya on 20200219 邮储资产负债表增加期权 start**/
    资产类_衍生金融资产_股票期权_02(DictCodeList.科目类型_资产类, "310601", "衍生金融资产", "股票期权", "02"),
    资产类_衍生金融资产_买入个股期权_02(DictCodeList.科目类型_资产类, "310602", "衍生金融资产", "买入个股期权", "02"),
    资产类_衍生金融资产_买入指数期权_02(DictCodeList.科目类型_资产类, "310603", "衍生金融资产", "买入指数期权", "02"),
    资产类_衍生金融资产_买入期货期权_02(DictCodeList.科目类型_资产类, "310604", "衍生金融资产", "买入期货期权", "02"),
    /** add by yanya on 20200219 邮储资产负债表增加期权 end**/

    资产类_衍生金融资产_其他衍生工具_02(DictCodeList.科目类型_资产类, "3111", "衍生金融资产", "其他衍生工具", "02"),

    资产类_衍生金融资产_套期工具_02(DictCodeList.科目类型_资产类, "3201", "衍生金融资产", "套期工具", "02"),

    资产类_衍生金融资产_被套期项目_02(DictCodeList.科目类型_资产类, "3202", "衍生金融资产", "被套期项目", "02"),

    资产类_以公允价值计量且其变动计入当期损益的金融资产_以公允价值计量且其变动计入当期损益类债券投资_02(DictCodeList.科目类型_资产类, "1103", "以公允价值计量且其变动计入当期损益的金融资产",
            "以公允价值计量且其变动计入当期损益类债券投资", "02"),

    资产类_以公允价值计量且其变动计入当期损益的金融资产_公允价值损益类_基金投资_02(DictCodeList.科目类型_资产类, "1105", "以公允价值计量且其变动计入当期损益的金融资产", "公允价值损益类-基金投资", "02"),

    资产类_以公允价值计量且其变动计入当期损益的金融资产_公允价值损益类_计划类资产投资_02(DictCodeList.科目类型_资产类, "1107", "以公允价值计量且其变动计入当期损益的金融资产",
            "公允价值损益类-计划类资产投资", "02"),

    资产类_以公允价值计量且其变动计入当期损益的金融资产_公允价值损益类_股票投资_02(DictCodeList.科目类型_资产类, "1108", "以公允价值计量且其变动计入当期损益的金融资产", "公允价值损益类-股票投资", "02"),

    资产类_以公允价值计量且其变动计入其他综合收益的金融资产_以公允价值且其变动计入其他综合收益类债券投资_02(DictCodeList.科目类型_资产类, "1104", "以公允价值计量且其变动计入其他综合收益的金融资产",
        "以公允价值且其变动计入其他综合收益类债券投资", "02"),

    资产类_以公允价值计量且其变动计入其他综合收益的金融资产_公允价值损益类_计划类货币型资产投资_02(DictCodeList.科目类型_资产类, "1110", "以公允价值计量且其变动计入当期损益的金融资产",
            "公允价值损益类-计划类（货币型）资产投资", "02"),

    资产类_以公允价值计量且其变动计入其他综合收益的金融资产_综合收益类债券减值准备_02(DictCodeList.科目类型_资产类, "130202", "以公允价值计量且其变动计入当期损益的金融资产",
        "综合收益类债券减值准备", "02"),
    
    资产类_以摊余成本计量的金融资产_摊余成本类债券投资_02(DictCodeList.科目类型_资产类, "1102", "以摊余成本计量的金融资产", "摊余成本类债券投资", "02"),

    资产类_以摊余成本计量的金融资产_摊余成本类_计划类资产投资_02(DictCodeList.科目类型_资产类, "1106", "以摊余成本计量的金融资产", "摊余成本类-计划类资产投资", "02"),
    
    资产类_以摊余成本计量的金融资产_摊余成本类债券减值准备_02(DictCodeList.科目类型_资产类, "130201", "以摊余成本计量的金融资产", "摊余成本类债券减值准备", "02"),
    
    资产类_以摊余成本计量的金融资产_摊余成本类计划类资产减值准备_02(DictCodeList.科目类型_资产类, "130203", "以摊余成本计量的金融资产", "摊余成本类计划类资产减值准备", "02"),

    资产类_应收利息_应收利息_02(DictCodeList.科目类型_资产类, "1204", "应收利息", "应收利息", "02"),

    //资产类_应收利息_非上市债券应收利息_02(DictCodeList.科目类型_资产类, "1205", "应收利息", "非上市债券应收利息", "02"),

    资产类_应收证券清算款_02(DictCodeList.科目类型_资产类, "3003", "应收证券清算款", "证券清算款", "02"),

    资产类_应收红利_02(DictCodeList.科目类型_资产类, "1203", "应收红利", "应收红利", "02"),

    资产类_应收申购款_02(DictCodeList.科目类型_资产类, "1207", "应收申购款", "应收申购款", "02"),

    //资产类_其他资产_非上市债券成本_02(DictCodeList.科目类型_资产类, "1109", "其他资产", "非上市债券成本", "02"),

    资产类_其他资产_其他应收款_02(DictCodeList.科目类型_资产类, "1221", "其他资产", "其他应收款", "02"),

    //资产类_其他资产_资产减值准备_02(DictCodeList.科目类型_资产类, "1302", "其他资产", "资产减值准备", "02"),

    //资产类_其他资产_坏账准备_02(DictCodeList.科目类型_资产类, "1303", "其他资产", "坏账准备", "02"),

    资产类_其他资产_应收逾期款_02(DictCodeList.科目类型_资产类, "1304", "其他资产", "应收逾期款", "02"),

    资产类_其他资产_待摊费用_02(DictCodeList.科目类型_资产类, "1501", "其他资产", "待摊费用", "02"),

    资产类_其他资产_应付账款_02(DictCodeList.科目类型_资产类, "3004", "其他资产", "应付账款", "02"),

    负债类_拆入资金_02(DictCodeList.科目类型_负债类, "2001", "拆入资金", "拆入款项", "02"),

    负债类_以公允价值计量且其变动计入当期损益的金融负债_02(DictCodeList.科目类型_负债类, "2101", "以公允价值计量且其变动计入当期损益的金融负债", "以公允价值计量且其变动计入当期损益类金融负债", "02"),

    负债类_衍生金融负债_外汇买卖_02(DictCodeList.科目类型_负债类, "3101", "衍生金融负债", "外汇买卖", "02"),

    负债类_衍生金融负债_外汇结售汇_02(DictCodeList.科目类型_负债类, "3102", "衍生金融负债", "外汇结售汇", "02"),

    负债类_衍生金融负债_金融掉期_02(DictCodeList.科目类型_负债类, "3103", "衍生金融负债", "金融掉期", "02"),

    负债类_衍生金融负债_远期投资_02(DictCodeList.科目类型_负债类, "3104", "衍生金融负债", "远期投资", "02"),

    负债类_衍生金融负债_期货投资_02(DictCodeList.科目类型_负债类, "3105", "衍生金融负债", "期货投资", "02"),

    /** add by yanya on 20200219 邮储资产负债表增加期权 start**/
    负债类_衍生金融负债_股票期权_02(DictCodeList.科目类型_负债类, "310601", "衍生金融负债", "股票期权", "02"),
    负债类_衍生金融负债_卖出个股期权_02(DictCodeList.科目类型_负债类, "310605", "衍生金融负债", "卖出个股期权", "02"),
    负债类_衍生金融负债_卖出指数期权_02(DictCodeList.科目类型_负债类, "310606", "衍生金融负债", "卖出指数期权", "02"),
    负债类_衍生金融负债_卖出期货期权_02(DictCodeList.科目类型_负债类, "310607", "衍生金融负债", "卖出期货期权", "02"),
    /** add by yanya on 20200219 邮储资产负债表增加期权 end**/

    负债类_衍生金融负债_其他衍生工具_02(DictCodeList.科目类型_负债类, "3111", "衍生金融负债", "其他衍生工具", "02"),

    负债类_衍生金融负债_套期工具_02(DictCodeList.科目类型_负债类, "3201", "衍生金融负债", "套期工具", "02"),

    负债类_衍生金融负债_被套期项目_02(DictCodeList.科目类型_负债类, "3202", "衍生金融负债", "被套期项目", "02"),

    负债类_卖出回购金融资产款_02(DictCodeList.科目类型_负债类, "2202", "卖出回购金融资产款", "卖出回购金融资产款", "02"),

    负债类_应付管理人报酬_02(DictCodeList.科目类型_负债类, "2206", "应付管理人报酬", "应付管理人报酬", "02"),

    负债类_应付交易费用_02(DictCodeList.科目类型_负债类, "2209", "应付交易费用", "应付交易费用", "02"),

    负债类_应付托管费_02(DictCodeList.科目类型_负债类, "2207", "应付托管费", "应付托管费", "02"),

    负债类_应付销售服务费_02(DictCodeList.科目类型_负债类, "2208", "应付销售服务费", "应付销售服务费", "02"),

    负债类_应付利息_02(DictCodeList.科目类型_负债类, "2231", "应付利息", "应付利息", "02"),

    负债类_应付赎回款_02(DictCodeList.科目类型_负债类, "2203", "应付赎回款", "应付赎回款", "02"),

    负债类_应付证券清算款_02(DictCodeList.科目类型_负债类, "3003", "应付证券清算款", "证券清算款", "02"),

    负债类_应付利润_02(DictCodeList.科目类型_负债类, "2232", "应付利润", "应付利润", "02"),

    负债类_其他负债_应付赎回费_02(DictCodeList.科目类型_负债类, "2204", "其他负债", "应付赎回费", "02"),

    负债类_其他负债_应付代销费_02(DictCodeList.科目类型_负债类, "2210", "其他负债", "应付代销费", "02"),

    负债类_其他负债_应付外包服务费_02(DictCodeList.科目类型_负债类, "2211", "其他负债", "应付外包服务费", "02"),

    负债类_其他负债_应付投顾费_02(DictCodeList.科目类型_负债类, "2205", "其他负债", "应付投顾费", "02"),

    负债类_其他负债_应付推介费_02(DictCodeList.科目类型_负债类, "2212", "其他负债", "应付推介费", "02"),

    负债类_其他负债_合作方应交税费_02(DictCodeList.科目类型_负债类, "2213", "其他负债", "合作方应交税费", "02"),

    负债类_其他负债_应交税费_02(DictCodeList.科目类型_负债类, "2221", "其他负债", "应交税费", "02"),

    负债类_其他负债_应付账款_02(DictCodeList.科目类型_负债类, "3004", "其他负债", "应付账款", "02"),

    负债类_其他负债_待清算资金_02(DictCodeList.科目类型_负债类, "2233", "其他负债", "待清算资金", "02"),

    负债类_其他负债_其他应付款_02(DictCodeList.科目类型_负债类, "2241", "其他负债", "其他应付款", "02"),

    负债类_其他负债_预提费用_02(DictCodeList.科目类型_负债类, "2501", "其他负债", "预提费用", "02"),

    所有者权益类_实收资本_02(DictCodeList.科目类型_所有者权益类, "4001", "实收资本", "实收资本", "02"),

    所有者权益类_资本公积_02(DictCodeList.科目类型_所有者权益类, "4002", "资本公积", "资本公积", "02"),

    所有者权益类_其他综合收益_02(DictCodeList.科目类型_所有者权益类, "4003", "其他综合收益", "其他综合收益", "02"),

    所有者权益类_未分配利润_利息收入_02(DictCodeList.科目类型_所有者权益类, "6011", "未分配利润", "利息收入", "02"),

    所有者权益类_未分配利润_公允价值变动损益_02(DictCodeList.科目类型_所有者权益类, "6101", "未分配利润", "公允价值变动损益", "02"),

    所有者权益类_未分配利润_投资收益_02(DictCodeList.科目类型_所有者权益类, "6111", "未分配利润", "投资收益", "02"),

    所有者权益类_未分配利润_汇兑损益_02(DictCodeList.科目类型_所有者权益类, "6112", "未分配利润", "汇兑损益", "02"),

    所有者权益类_未分配利润_其他收入_02(DictCodeList.科目类型_所有者权益类, "6302", "未分配利润", "其他收入", "02"),

    所有者权益类_未分配利润_管理人报酬_02(DictCodeList.科目类型_所有者权益类, "6403", "未分配利润", "管理人报酬", "02"),

    所有者权益类_未分配利润_托管费_02(DictCodeList.科目类型_所有者权益类, "6404", "未分配利润", "托管费", "02"),

    所有者权益类_未分配利润_销售服务费_02(DictCodeList.科目类型_所有者权益类, "6406", "未分配利润", "销售服务费", "02"),

    所有者权益类_未分配利润_代销费_02(DictCodeList.科目类型_所有者权益类, "6409", "未分配利润", "代销费", "02"),

    所有者权益类_未分配利润_外包服务费_02(DictCodeList.科目类型_所有者权益类, "6410", "未分配利润", "外包服务费", "02"),

    所有者权益类_未分配利润_交易费用_02(DictCodeList.科目类型_所有者权益类, "6407", "未分配利润", "交易费用", "02"),

    所有者权益类_未分配利润_税费支出_02(DictCodeList.科目类型_所有者权益类, "6408", "未分配利润", "税费支出", "02"),

    所有者权益类_未分配利润_利息支出_02(DictCodeList.科目类型_所有者权益类, "6411", "未分配利润", "利息支出", "02"),

    所有者权益类_未分配利润_资产减值损失_02(DictCodeList.科目类型_所有者权益类, "6412", "未分配利润", "资产减值损失", "02"),

    所有者权益类_未分配利润_推介费支出_02(DictCodeList.科目类型_所有者权益类, "6413", "未分配利润", "推介费支出", "02"),

    所有者权益类_未分配利润_合作方应交税费支出_02(DictCodeList.科目类型_所有者权益类, "6414", "未分配利润", "合作方应交税费支出", "02"),

    所有者权益类_未分配利润_其他费用_02(DictCodeList.科目类型_所有者权益类, "6605", "未分配利润", "其他费用", "02"),

    所有者权益类_未分配利润_其他支出_02(DictCodeList.科目类型_所有者权益类, "6702", "未分配利润", "其他支出", "02"),

    所有者权益类_未分配利润_以前年度损益调整_02(DictCodeList.科目类型_所有者权益类, "6901", "未分配利润", "以前年度损益调整", "02"),

    所有者权益类_未分配利润_损益平准金_02(DictCodeList.科目类型_所有者权益类, "4011", "未分配利润", "损益平准金", "02"),

    所有者权益类_未分配利润_本期利润_02(DictCodeList.科目类型_所有者权益类, "4103", "未分配利润", "本期利润", "02"),

    所有者权益类_未分配利润_利润分配_02(DictCodeList.科目类型_所有者权益类, "4104", "未分配利润", "利润分配", "02"),

    特殊处理C_所有者权益类_其他综合收益_02(DictCodeList.科目类型_所有者权益类, "SD_C_4003", "其他综合收益", "其他综合收益", "02"),
    特殊处理D_所有者权益类_其他综合收益_02(DictCodeList.科目类型_所有者权益类, "SD_D_4003", "其他综合收益", "其他综合收益", "02"),
	;

	/**
	 * 对应于数据字典code
	 */
	private String value;

	/**
	 * 数据字典枚举
	 */
	private DictCodeList dictCodeList;

	/**
	 * 资产名称
	 */
	private String assetName;

	/**
	 * 科目名称
	 */
	private String subjectName;
	
	/**
     * 模板类型 add by yanya 20190929
     */
    private String finType;
	

    /** update by yanya on 20190929 增加邮储模板类型
	AssetLiabilityStatementEnum(DictCodeList dictCodeList, String value, String assetName, String subjectName) {
		this.dictCodeList = dictCodeList;
		this.value = value;
		this.assetName = assetName;
		this.subjectName = subjectName;
	}**/
	AssetLiabilityStatementEnum(DictCodeList dictCodeList, String value, String assetName, String subjectName,String finType) {
	    this.dictCodeList = dictCodeList;
	    this.value = value;
	    this.assetName = assetName;
	    this.subjectName = subjectName;
	    this.finType = finType;
	}

	/**
	 * 获取科目代码valueList modify by yanya on 20190929 按照系统参数模板类型进行
	 *
	 * @param finType 类型
	 * @param dictCode
	 *            DictCode
	 * @return List
	 * @see
	 * @since 1.0
	 */
	public static List<String> valuesfromDictCode(String finType,DictCodeList... dictCodeLists) {
		List<String> result = new ArrayList<>();
		AssetLiabilityStatementEnum[] values = AssetLiabilityStatementEnum.values();
		for (AssetLiabilityStatementEnum item : values) {
			for (DictCodeList dictCodeList : dictCodeLists) {
			    /**modify by yanya on 20190927 增加根据财务四表模板类型查询配置 start**/
				if (item.getDictCodeList() == dictCodeList && finType.equals(item.getFinType())) {
				/**modify by yanya on 20190927 增加根据财务四表模板类型查询配置 end**/
					result.add(item.getValue());
				}
			}
		}
		return result;
	}

	/**
	 * 获取枚举 通过科目号value
	 *
	 * @param dictCode
	 *            DictCode
	 * @return List&lt;SelectOptionDto&gt;
	 * @see
	 * @since 1.0
	 */
	public static List<AssetLiabilityStatementEnum> enumsfromValue(String value,String finType) {
		List<AssetLiabilityStatementEnum> list = Lists.newArrayList();
		for (AssetLiabilityStatementEnum item : values()) {
			if (StringUtils.equals(item.getValue(), value) && StringUtils.equals(item.getFinType(), finType)) {
				list.add(item);
			}
		}
		return list;
		// throw new RuntimeException("没有找到该枚举类型！");
	}

	public String getValue() {
		return value;
	}

	public DictCodeList getDictCodeList() {
		return dictCodeList;
	}

	public String getAssetName() {
		return assetName;
	}

	public String getSubjectName() {
		return subjectName;
	}

    
    public String getFinType() {
        return finType;
    }

    
    public void setFinType(String finType) {
        this.finType = finType;
    }
	
	
}
